In [1]:
import pandas as pd

In [2]:
header = ['state', 'sex', 'age', 'pop2000', 'pop2008']

In [3]:
df = pd.read_excel('census.xlsx', names=header)
df.shape

(8771, 5)

In [4]:
# Remove duplicates
df.drop_duplicates(inplace=True)
df.shape

(8771, 5)

In [5]:
df.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [6]:
# Datatype
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8771 entries, 0 to 8770
Data columns (total 5 columns):
state      8771 non-null object
sex        8771 non-null object
age        8771 non-null int64
pop2000    8771 non-null int64
pop2008    8771 non-null int64
dtypes: int64(3), object(2)
memory usage: 411.1+ KB

In [7]:
# Summary stats
df.describe()

               age        pop2000        pop2008
count  8771.000000    8771.000000    8771.000000
mean     42.504846   32017.980276   34520.761715
std      24.823065   39628.939311   42505.633887
min       0.000000     217.000000     391.000000
25%      21.000000    7572.500000    8091.500000
50%      43.000000   19521.000000   20975.000000
75%      64.000000   39873.500000   42425.000000
max      85.000000  294583.000000  400288.000000

In [8]:
# Show duplicated
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [state, sex, age, pop2000, pop2008]
Index: []

## Indexing

In [9]:
# Index column then row
df['pop2000'][0]

88445

In [10]:
# Index column then row
df.pop2000[0]

88445

In [11]:
# Index by label
df.loc[0, 'pop2000']

88445

In [12]:
# Index by position
df.iloc[0, 3]

88445

In [13]:
df[['pop2000']].iloc[0]

pop2000    88445
Name: 0, dtype: int64

In [14]:
df.iloc[0][['pop2000']]

pop2000    88445
Name: 0, dtype: object

## Slicing

In [15]:
# Series
type(df['pop2000'])

pandas.core.series.Series

In [16]:
# dfframe
type(df[['pop2000']])

pandas.core.frame.DataFrame

In [17]:
# 1st row of pop2000
df.pop2000[0:1]

0    88445
Name: pop2000, dtype: int64

In [18]:
# head of pop2000
df.pop2000.head()

0    88445
1    88729
2    88868
3    91947
4    93894
Name: pop2000, dtype: int64

In [19]:
# All rows, some cols
df.loc[:, 'age':'pop2008'].head()

   age  pop2000  pop2008
0    1    88445    91829
1    2    88729    89547
2    3    88868    90037
3    4    91947    91111
4    5    93894    89802

In [20]:
# Some rows, all cols
df.loc[:4, :]

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [21]:
# 1st five rows of specific cols
df.loc[:4, ['age','pop2008']]

   age  pop2008
0    1    91829
1    2    89547
2    3    90037
3    4    91111
4    5    89802

In [22]:
# 4 specific rows of all cols
df.loc[[0,2,4,6], :]

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
2  Illinois   M    3    88868    90037
4  Illinois   M    5    93894    89802
6  Illinois   M    7    94818    90940

## Filtering

In [23]:
# Create boolean series
df.age[:4] > 20

0    False
1    False
2    False
3    False
Name: age, dtype: bool

In [24]:
# Filter with boolean series
df[df.age > 20].head()

       state sex  age  pop2000  pop2008
20  Illinois   M   21    85176    91373
21  Illinois   M   22    84372    90723
22  Illinois   M   23    85529    91982
23  Illinois   M   24    84549    90237
24  Illinois   M   25    87630    95217

In [25]:
# Both conditions
df[(df.age > 20) & (df.sex == 'F')].head()

        state sex  age  pop2000  pop2008
106  Illinois   F   21    82416    88640
107  Illinois   F   22    81888    88671
108  Illinois   F   23    83219    88442
109  Illinois   F   24    82301    88009
110  Illinois   F   25    84817    92928

In [26]:
# Either conditions
df[(df.age > 20) | (df.sex == 'M')].head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [27]:
# Select cols with all nonzeros
df.loc[:, df.all()].head()

      state sex  pop2000  pop2008
0  Illinois   M    88445    91829
1  Illinois   M    88729    89547
2  Illinois   M    88868    90037
3  Illinois   M    91947    91111
4  Illinois   M    93894    89802

In [28]:
# Select cols with any nonzeros
df.loc[:, df.any()].head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [29]:
# Select cols with any NaNs
df.loc[:, df.isnull().any()].head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [30]:
# Select cols without any NaNs
df.loc[:, df.notnull().all()].head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [31]:
# Drop rows with any NaNs
df.dropna(how='any').head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

In [32]:
# Filtering a col based on another
df.pop2008[df.sex == 'F'].head()

85    90286
86    88126
87    86291
88    85170
89    86959
Name: pop2008, dtype: int64

## Transformation

In [33]:
# Vectorized methods: convert to dozen units
# On col 3 & 4
df.iloc[:, 3:].floordiv(12).head()

   pop2000  pop2008
0     7370     7652
1     7394     7462
2     7405     7503
3     7662     7592
4     7824     7483

In [34]:
# Plain python function
# On col 3 & 4
df.iloc[:, 3:].apply(lambda x: x//12).head()

   pop2000  pop2008
0     7370     7652
1     7394     7462
2     7405     7503
3     7662     7592
4     7824     7483

In [35]:
temp = df.copy()
temp['pop2000dozen'] = temp.pop2000.floordiv(12)
temp.head()

      state sex  age  pop2000  pop2008  pop2000dozen
0  Illinois   M    1    88445    91829          7370
1  Illinois   M    2    88729    89547          7394
2  Illinois   M    3    88868    90037          7405
3  Illinois   M    4    91947    91111          7662
4  Illinois   M    5    93894    89802          7824

In [36]:
df.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            8761, 8762, 8763, 8764, 8765, 8766, 8767, 8768, 8769, 8770],
           dtype='int64', length=8771)

In [37]:
temp = df.copy()
temp['8yearsdifference'] = temp.pop2008 - temp.pop2000
temp.head()

      state sex  age  pop2000  pop2008  8yearsdifference
0  Illinois   M    1    88445    91829              3384
1  Illinois   M    2    88729    89547               818
2  Illinois   M    3    88868    90037              1169
3  Illinois   M    4    91947    91111              -836
4  Illinois   M    5    93894    89802             -4092

## Indexing & labelling

In [38]:
# Creating a Series
prices = [10.70, 10.86, 10.74, 10.71, 10.79]
shares = pd.Series(prices)
shares

0    10.70
1    10.86
2    10.74
3    10.71
4    10.79
dtype: float64

In [39]:
# Creating a Series with index
days = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri']
shares = pd.Series(prices, index=days)
shares

Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

In [40]:
shares.index

Index(['Mon', 'Tue', 'Wed', 'Thur', 'Fri'], dtype='object')

In [41]:
shares.index[-2:]

Index(['Thur', 'Fri'], dtype='object')

In [42]:
# Modify index name
shares.index.name = 'Weekday'
shares

Weekday
Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

In [43]:
# Assigning the index
temp = df.copy()
temp.index = temp.age
temp.head()

        state sex  age  pop2000  pop2008
age
1    Illinois   M    1    88445    91829
2    Illinois   M    2    88729    89547
3    Illinois   M    3    88868    90037
4    Illinois   M    4    91947    91111
5    Illinois   M    5    93894    89802

In [44]:
df.index.name

In [45]:
df.columns

Index(['state', 'sex', 'age', 'pop2000', 'pop2008'], dtype='object')

## Hierarchical indexing

In [46]:
# Multiindex
temp = df.set_index(['age','state'])
temp.head()

             sex  pop2000  pop2008
age state
1   Illinois   M    88445    91829
2   Illinois   M    88729    89547
3   Illinois   M    88868    90037
4   Illinois   M    91947    91111
5   Illinois   M    93894    89802

In [47]:
temp.index.name

In [48]:
temp.index.names

FrozenList(['age', 'state'])

In [49]:
# Sort index
temp.sort_index().head()

            sex  pop2000  pop2008
age state
0   Alabama   M    30479    32055
    Alabama   F    29131    30600
    Alaska    M     4934     5674
    Alaska    F     4509     5453
    Arizona   M    40415    54792

In [50]:
temp.loc[(0, 'Alaska')]

/home/anonymous/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

           sex  pop2000  pop2008
age state
0   Alaska   M     4934     5674
    Alaska   F     4509     5453

In [51]:
temp.loc[(0, 'Alaska'), 'pop2000']

/home/anonymous/anaconda3/lib/python3.6/site-packages/pandas/core/indexing.py:1495: PerformanceWarning: indexing past lexsort depth may impact performance.
  return self._getitem_tuple(key)

age  state
0    Alaska    4934
     Alaska    4509
Name: pop2000, dtype: int64

In [52]:
# Slicing (outermost index)
temp.loc[0].head()

                     sex  pop2000  pop2008
state
Illinois               F    85910    90286
New Jersey             M    56983    58756
District of Columbia   M     3358     4017
District of Columbia   F     3219     3869
New Jersey             F    54679    55841

In [53]:
# Fancy indexing (outermost index)
temp.loc[([0,1], 'Alaska'), :]

           sex  pop2000  pop2008
age state
0   Alaska   M     4934     5674
1   Alaska   M     4785     5498
0   Alaska   F     4509     5453
1   Alaska   F     4602     5387

In [54]:
temp.loc[([0,1], 'Alaska'), 'pop2000']

age  state
0    Alaska    4934
1    Alaska    4785
0    Alaska    4509
1    Alaska    4602
Name: pop2000, dtype: int64

In [55]:
# Fancy indexing (innermost index)
temp.loc[(0, ['Alaska', 'New Jersey']), :]

               sex  pop2000  pop2008
age state
0   New Jersey   M    56983    58756
    New Jersey   F    54679    55841
    Alaska       M     4934     5674
    Alaska       F     4509     5453

## Pivoting

In [56]:
df.pivot_table(index='age', columns='sex', values='pop2000').head()

sex             F             M
age
0    36888.843137  37691.560000
1    36401.607843  38104.686275
2    36415.098039  38142.882353
3    36661.039216  38313.921569
4    37383.647059  39182.137255

## Stacking & unstacking

In [57]:
# Multi-level index
temp = df.set_index(['age','sex'])
print(type(temp))
temp.head()

<class 'pandas.core.frame.DataFrame'>

            state  pop2000  pop2008
age sex
1   M    Illinois    88445    91829
2   M    Illinois    88729    89547
3   M    Illinois    88868    90037
4   M    Illinois    91947    91111
5   M    Illinois    93894    89802

In [58]:
print(type(temp))
temp.sort_index().head()

<class 'pandas.core.frame.DataFrame'>

                        state  pop2000  pop2008
age sex
0   F                Illinois    85910    90286
    F    District of Columbia     3219     3869
    F              New Jersey    54679    55841
    F                 Florida    92803   113205
    F                   Idaho     9755    12063

In [59]:
temp = temp.stack()
print(type(temp))
temp.head()

<class 'pandas.core.series.Series'>

age  sex
1    M    state      Illinois
          pop2000       88445
          pop2008       91829
2    M    state      Illinois
          pop2000       88729
dtype: object

## Melting

In [60]:
temp = pd.melt(df)
temp.sample(5)

      variable  value
25919      age     24
31667  pop2000   5416
37822  pop2008   5223
38287  pop2008  38990
14322      sex      F

In [61]:
temp = pd.melt(df, id_vars='state')
temp.sample(5)

               state variable  value
27887  Massachusetts  pop2008  21240
23095      Tennessee  pop2000  46575
25493       Oklahoma  pop2000  11683
7616        Kentucky      sex      F
25216       Kentucky  pop2000  13601